[LANG]
language=Korean (조선)
[FONT]
font-name=Malgun Gothic
welcome-text-size=64
home-text-size=24
home-section-size=26
analysis-text-size=22
analysis-section-size=24
left-panel-size=18
panel-list-size=18
panel-list-label-size=22
panel-list-header-size=18
panel-list-item-size=15
panel-button-size=14
combobox-size=18
list-combobox-size=18
checkbox-size=16
radio-size=17
elem-size=12
image-button-size=16
form-text-size=17
list-text-size=18
search-edit-size=18
message-text-size=18
setting-button-size=14
process-text-size=16
properites-title-font=20
properites-section-font=18
log-list-item-text-size=14
log-list-item-sql-size=16
[ERROR]
000000=
200001=SQL 구문오류
200002=파일이 존재하지 않습니다
200003=파일이 손상되였습니다
200004=매개변수오류
200026=표이름이 중복되였습니다
200027=표이름이 존재하지 않습니다
200028=CSV 파일 들여오기 오류, SQL 을 생성하지 못했습니다. CSV 파일 내용과 설정항목이 올바른지 확인하십시오.
300001=색인을 생성할 표의 열이 선택되지 않았습니다
300002=SQL 문은 비워둘수 없습니다
300003=SQL 분석은 SELECT 질의문만 지원합니다
[STRING]
home=홈
database=자료기둥
analysis=분석
view=보기
setting=설정
items=건 기록
tables=자료표
views=보기
triggers=트리거
columns=열
indexes=색인
table=표
clear-all=모두 지우기
yes=예
no=아니오
welcome-text=CuteSqlite 에 오신것을 환영합니다
home-text1=CuteSqlite 는 Sqlite3 의 그래픽사용자클라이언트 (GUI) 도구입니다.
home-text2=자료기둥을 설계, 생성 및 탐색하고, 자료기둥객체를 처리하며,
home-text3=데이터를 삽입하고 저장된 데이터를 처리하기 위한 SQL 질의를 설계 및 실행할수 있습니다.
home-text4=또한 다른 자료기둥공급업체에서 Sqlite 자료기둥으로 자료기둥과 데이터를 이전할수 있습니다.
db-section-text=Sqlite 자료기둥
analysis-text1=CuteSqlite 를 사용하면 SQL 문의 성능을 분석하고 최적화할수 있습니다.
analysis-text2=또한 자료기둥의 각 표의 저장용량을 분석할수 있으며,
analysis-text3=자료기둥의 매개변수를 구성하여 자료기둥을 최적화할수 있습니다.
perf-analysis-section-text=성능분석
error-text=체계오류:
create-database=새 자료기둥 만들기 (Ctrl+N)
open-database=자료기둥 열기 (Ctrl+O)
refresh-database=자료기둥 새로 고침 (F5)
delete-database=목록에서 선택한 자료기둥 제거 (Del)
override-user-db=파일 데이터를 삭제하면 복구할수 없습니다. 자료기둥을 덮어쓰시겠습니까?
create-db-success-text=자료기둥 생성 성공
open-db-exists-inlist=자료기둥이 이미 열려있습니다. 중복작업을 하지 마십시오.
open-db-success-text=자료기둥 열기 성공
delete-user-db=목록에서 선택한 자료기둥 "{dbName}" 를 제거하시겠습니까?
delete-db-success-text=목록에서 자료기둥 제거 성공
query-editor=질의편집기
history=력사
history-tip=력사 (F8)
result-list=결과
result-info=정보
result-table-data=표 데이터
table-properties=표속성
exec-select-sql=현재 선택한 질의 실행 (F9)
exec-all-sql=모든 질의 실행 (F10)
explain-select-sql=현재 선택한 SQL 문 Explain (F11)
explain-query-plan-sql=현재 선택한 SQL 문 Explain query plan (F12)
query-page-help=자동완성기능: [Tab]->다음 탭; [Ctrl+Space]->일치하는 탭 목록; [Ctrl+Enter]->모든 탭 목록
no-select-userdb=자료기둥이 선택되지 않았습니다
no-sql-statement=질의편집기에 SQL 문이 입력되지 않았습니다
no-sql-content=질의편집기에 SQL 문이 없습니다
show-form-view=양식보기 표시
export-result-as=내보내기... (Ctrl+Alt+E)
copy-result-data=데이터를 쪽지판에 복사
clear-all=모두 지우기
ok=확인
cancel=취소
export-text-description=데이터 내보내기 형식 선택
csv-settings=csv 옵션
csv-field-settings=열
csv-line-settings=행
csv-charset-settings=부호화
excel-settings=Excel 옵션
sql-settings=SQL 옵션
export-fields-settings=내보낼 열 선택
terminated-by=구분기호
enclosed-by=포함기호
escaped-by=이스케이프기호
field-terminated-by=열구분기호
field-enclosed-by=열포함기호
field-escaped-by=열이스케이프기호
line-terminated-by=줄바꿈기호
add-column-name=헤더에 열이름 추가
csv-charset=부호화
excel-column-max-size=텍스트열크기제한
excel-decinmal-places=소수자리수
structure-only=표구조만
data-only=데이터만
structure-and-data=표구조 및 데이터
select-all=모두 선택
deselect-all=모두 선택해제
save-to-file=파일로 내보내기
expert-fmt-error=데이터 내보내기 파일형식을 선택하십시오.
terminated-by-error="종료"값을 입력하십시오.
enclosed-by-error="포함"값을 입력하십시오.
escaped-by-error="이스케이프기호"값을 입력하십시오.
line-terminated-by-error=행의 "종료"값이 올바르지 않습니다.
excel-column-max-size-error="텍스트열크기제한"값을 입력하십시오.
excel-decinmal-places-error="소수자리수"값을 입력하십시오.
export-sql-error=SQL 옵션을 선택하십시오.
selected-fields-error=내보낼 열을 선택하십시오.
export-path-error=내보내기 파일경로를 입력하십시오.
sql-notsupport-multitable-query-error=다중표질의 및 하위질의 결과 내보내기는 지원되지 않습니다.
export-success-text=내보내기 성공, {rows} 행 데이터를 내보냈습니다. 파일을 여시겠습니까?
open-the-file=파일 열기
export-file-exists-prompt={export-path} 이 이미 존재합니다. 교체하시겠습니까?
limit-rows=행제한
offset=시작행
rows=행수
copy-all-rows-to-clipboard=모든 행을 쪽지판에 복사	Ctrl+Alt+A
copy-sel-rows-to-clipboard=선택한 행을 쪽지판에 복사	Ctrl+Alt+H
copy-all-rows-as-sql=모든 행을 SQL 로 복사	Ctrl+Alt+J
copy-sel-rows-as-sql=선택한 행을 SQL 로 복사	Ctrl+Alt+K
read-only=읽기 전용
filter=필터 (Ctrl+Alt+F)
filter-in-use=필터 사용중
refresh=새로 고침 (Ctrl+F5)
refresh-page=새로 고침
new-row-tip=새 행 만들기 (Ctrl+Alt+N)
copy-row-tip=행 복사 (Ctrl+Alt+C)
save-tip=저장 (Ctrl+Alt+S)
delete-tip=선택한 행 삭제 (Ctrl+Del)
cancel-tip=변경사항 취소 (Ctrl+Alt+Z)
revert-tip=복원
save=저장
revert=변경사항 취소
column=열이름
condition=조건
value=값
delete-confirm-text=선택한 행을 삭제하시겠습니까?
query=질의
result=결과
affected-rows=영향받은 행수
exec-time=실행시간
transfer-time=전송시간
total-time=총시간
database-create=새 자료기둥 만들기		Ctrl+N
database-open=자료기둥 열기		Ctrl+O
database-refresh=자료기둥 새로 고침		Ctrl+R
database-delete=자료기둥 삭제		Del
database-copy=자료기둥 복사...	Ctrl+P
database-export-as-sql=자료기둥을 SQL 로 내보내기	Ctrl+E
database-import-from-sql=SQL 을 자료기둥으로 들여오기	Ctrl+I
database-new=만들기
database-new-table=표
database-new-view=보기
database-new-trigger=트리거
export-as-sql-text-description=선택한 자료기둥의 표/보기/트리거를 SQL 형식으로 내보내기
select-database=선택한 자료기둥
database-objects=객체
structure-and-data-settings=구조 및 데이터 설정
insert-statement-settings=INSERT 문 설정
tbl-statement-settings=자료표 문 설정
retain-column-text="Insert Into"에서 열이름 유지
contain-multi-rows-text=각 "Insert"문에 여러 행 (VALUES) 포함
retain-table-text=이전 표 유지 (Create Table If Not Exists ...)
override-table-text=이전 표 덮어쓰기 (DROP TABLE,然後 CREATE TABLE)
import-from-sql-text-description=SQL 파일 내의 문을 일괄 실행합니다.
abort-on-error-text=오류 발생 시 중단합니다.
import-file-not-exists=들여올 SQL 파일이 존재하지 않습니다. 다시 선택하십시오.
import-path-empty-error=들여올 파일경로는 비워둘수 없습니다.
import=들여오기
export=내보내기
tbl-name=표이름
new-table=표 만들기
new-view=보기 만들기
new-trigger=트리거 만들기
database=자료기둥
schema=스키마
table-columns=열
table-indexes=색인
table-foreignkeys=외부키
column-name=열이름
data-type=데이터유형
default=기본값
check=검사
index-name=색인이름
index-type=색인유형
index-unique=Unique
partial-clause=부분절
comments=주석
to-be-selected=선택대기 열
selected=선택된 열
up=▲
down=▼
no-columns-selected=열이 선택되지 않았습니다. 선택하십시오.
sql-preview=SQL 미리보기
tbl-name-empty=표이름은 비워둘수 없습니다.
tbl-name-duplicated=표이름이 중복되였습니다.
create-table-success-text=표 생성 성공.
alter-table-success-text=표 수정 성공.
rename-table-success-text=표이름 수정 성공.
delete-column-confirm-text=선택한 열은 하나 이상의 색인에 의해 참조됩니다. 이 열을 삭제하면 해당 색인도 수정됩니다. 삭제를 계속하시겠습니까?
delete-index-confirm-text=선택한 색인은 하나 이상의 열에 의해 참조됩니다. 이 색인을 삭제하면 해당 열도 수정됩니다. 삭제를 계속하시겠습니까?
delete-confirm-text=삭제를 계속하시겠습니까?
new-view=보기 만들기
new-trigger=트리거 만들기
create-a-view-name=새 보기이름
view-name-not-empty=새 보기이름은 비워둘수 없습니다.
view-name-duplicated=보기이름이 중복되였습니다.
create-a-trigger-name=트리거이름
trigger-name-not-empty=트리거이름은 비워둘수 없습니다.
trigger-name-duplicated=트리거이름이 중복되였습니다.
execute-sql-success=SQL 실행 성공
copy-db-success-text=자료기둥 복사 성공
table-open=표데이터 열기		Alt+O
table-create=표 만들기		Alt+N
table-alter=표 수정		Alt+A
table-rename=표이름 변경		Alt+M
table-truncate=표 비우기		Alt+T
table-drop=표 삭제		Alt+Del
table-copy-as=표 복사...		Alt+P
table-sharding-as=샤딩		Alt+G
table-export=표 내보내기...	Alt+E
table-import-sql=SQL 파일에서 들여오기	Alt+I
table-import-csv=CSV 파일에서 들여오기	Alt+J
table-manage-index=표색인 관리
table-manage-foreign-key=표외부키 관리
properties=속성
primary-key-duplicated=기본키 (Primary key) 가 중복정의되였습니다.
foreignkey-name=외부키이름
referencing-columns=자신표열
referenced-table=외부참조표
referenced-columns=외부참조열
on-update=On Update
on-delete=On Delete
insert-new-column=새 열 추가
insert-new-index=새 색인 추가
insert-new-foreignkey=새 외부키 추가
insert-del-column=선택한 열 삭제
insert-del-index=선택한 색인 삭제
insert-del-foreignkey=선택한 외부키 삭제
select-referenced-table-first=먼저 외부참조표를 선택하십시오.
new-table-name=새 표이름
table-name-not-empty=새 표이름은 비워둘수 없습니다.
table-name-duplicated=새 표이름이 중복되였습니다.
ai-column-exists=자동증가열 (AUTOINCREMENT) 이 이미 존재합니다.
ai-fobidden-multi-pk=자동증가열 (AUTOINCREMENT) 이 이미 존재하므로 여러 기본키열은 허용되지 않습니다.
ai-column-must-integer=자동증가열 (AUTOINCREMENT) 은 INTEGER 정수유형이어야 합니다.
truncate-table-confirm-text=표를 비우면 데이터는 복구할수 없습니다. 비우시겠습니까?
truncate-table-success-text=자료표 비우기 성공
drop-table-confirm-text=자료표를 삭제하면 데이터는 복구할수 없습니다. 삭제하시겠습니까?
drop-table-success-text=자료표 삭제 성공
copy-table-text-description=복사매개변수 구성, 자료표샤딩 지원
from-db-name=원본자료기둥
from-tbl-name=원본표
to-db-name=대상자료기둥
to-tbl-name=대상표
table-sharding-setttings=자료표샤딩
enable-table-sharding=자료표샤딩 활성화
table-suffix-begin={suffix} 시작정수
table-suffix-end={suffix} 종료정수
advanced-settings=표샤딩고급옵션
enable-copy-data-with-strategy=전략활성화, 데이터를 샤딩표로 복사
sharding-strategy-express-text=표분할전략식: {n}
preview-sql=SQL 문 미리보기
structure-and-data-settings-unknown=구조 및 데이터 설정이 선택되지 않았습니다.
table-suffix-error=샤딩정수가 유효하지 않습니다. 올바른 값을 입력하십시오.
target-table-name-no-n=대상표에는 문자열 "{n}" 이 포함되어야 합니다.
sharding-strategy-express-empty=표분할전략식은 비워둘수 없습니다.
copy-table-success-text=표 복사 성공.
start=시작
complete=완료
express-title=표분할전략식
functions=함수
express-editor-help=식 - 함수 또는 열을 더블클릭하여 편집기에 삽입
import-from-csv-text-description=CSV 파일에서 데이터 들여오기 설정항목
source-csv-file=원본 CSV 파일경로
target-database=대상자료기둥
target-table=대상표
columns-setttings=열
csv-data=CSV 데이터
column-name-on-top=첫 번째 행을 열이름으로 사용
line-terminated-by=줄바꿈기호
csv-null-as-keyword=null/NULL 을 SQL 키워드로 사용
encoding=Encoding
import-success-text=들여오기 성공
incorrect-sql-statement=잘못된 SQL 문
import-error-text=들여오기 오류
table-manage-columns=열 관리
table-drop-column=열 삭제
table-manage-indexes=색인 관리
table-drop-index=색인 삭제
create-view=새 보기 만들기
open-view=보기 열기
drop-view=보기 삭제
create-trigger=트리거 만들기
open-trigger=트리거 열기
drop-trigger=트리거 삭제
drop-view-confirm-text=보기를 삭제하면 보기는 복구할수 없습니다. 삭제하시겠습니까?
drop-view-success-text=보기 삭제 성공
drop-trigger-confirm-text=트리거를 삭제하면 트리거는 복구할수 없습니다. 삭제하시겠습니까?
drop-trigger-success-text=트리거 삭제 성공
sql-templates=SQL 문 템플릿
pragma-templates=Pragmas
sql-log=SQL 력사
clear-all=모두 지우기
use=사용
explain=Explain
top=최상단
untop=최상단해제
copy=복사
delete=삭제
today=오늘
yestoday=어제
delete-sql-log-confirm-text=SQL 로그를 삭제하시겠습니까?
copy-to-clipboard=쪽지판에 복사됨
save-success-text=저장 성공
delete-success-text=삭제 성공
data-has-changed=데이터가 변경되였습니다. 페이지를 닫으시겠습니까?
not-save-and-close=저장하지 않고 닫기
cancel=닫기취소
table-export-as=자료표 내보내기	Alt+E
export-as-sql-success-text=내보내기 성공, 파일을 여시겠습니까?
new-query=새 질의창 만들기 (F7)
save-current=현재 저장 (Ctrl+S)
save-all=모두 저장 (Ctrl+Shift+S)
first-page=첫 페이지
prev-page=이전 페이지
next-page=다음 페이지
last-page=마지막 페이지
save-if-data-has-changed=데이터가 변경되였습니다. 먼저 저장하시겠습니까?
unsort=정렬해제
tab-close-this=닫기
tab-close-others=기타 닫기
tab-close-left=왼쪽 모두 닫기
tab-close-right=오른쪽 모두 닫기
perf-analysis=성능분석
perf-analysis-reports=분석보고서
store-analysis=저장소분석
db-params=자료기둥매개변수
not-select-sql=SELECT 문만 지원합니다.
open-sql-log=SQL 로그를 열어 성능분석 (Ctrl+L)
add-sql-analysis=SQL 문을 입력하여 성능분석 (Ctrl+I)
sql-log-not-found=SQL 로그를 찾을수 없습니다. 삭제되였는지 확인하십시오.
original-sql=원본 SQL 문
where-clause-analysis=WHERE 절 분석
order-clause-analysis=ORDER 절 분석
covering-index-analysis=커버링색인 분석
table-join-analysis=Joins 분석
in-table=자료표
where-use-column=WHERE 문에서 열 사용
order-use-column=ORDER 문에서 열 사용
covering-index-column=WHERE 및 ORDER 문에서 열 사용
where-use-index=WHERE 문에서 색인 사용
order-use-index=ORDER 문에서 색인 사용
use-covering-index=커버링색인 사용
create-index-for-performance=권장: 다음 열에 색인을 생성하면 질의성능이 향상됩니다.
hint-index-for-performance=힌트: 색인{hintIndexName} 이 포함된 열을 커버합니다: {hintIndexColumns}
create-covering-index-for-performance=권장: 다음 열에 커버링색인을 생성하면 질의성능이 향상됩니다.
create-index-togeger=색인 생성
create-index-individ=개별색인 생성
create-covering-index=커버링색인 생성
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=아래 의사코드는 질의최적화기의 실행과정을 보여줍니다.
cycle-count=루프통계
optimize-cycle-count=힌트: JOIN 표순서를 변경하면 루프횟수를 최적화하여 줄일수 있습니다.
general-settings=일반설정
about=정보
language-setting=인터페이스언어설정
change-language-restart-text=언어를 변경하려면 이 쏘프트웨어를 다시 시작해야 합니다.
close-and-restart=닫기 및 다시 시작
do-not-restart=다시 시작 안 함
about-us=회사정보
about-us-description=CuteSqlite 는 작성자 Xuehan Qin 이 개발한 오픈쏘스 쏘프트웨어입니다.
version-info=버전
version-info-description=CuteSqlite v0.2.2 beta (64 비트)
feedback=피드백
feedback-description=쏘프트웨어 문제가 있거나 이 응용프로그램에 대한 아이디어 및 제안이 있으면 아래 양식을 작성하여 피드백해 주십시오.
content-text=내용
license=Apache License Version 2.0
select-columns-analysis=Select 열 분석
select-use-column=Select 문에서 다음 열 사용
select-use-column-count=열수
select-use-column-advice=권장: SELECT 문에서 선택된 열이{maxColumns} 개를 초과했습니다. 열을 줄이면 질의성능이 향상됩니다.
select-use-column-tips=힌트: 열을 줄이면 질의성능이 향상됩니다.
sql-perf-report-prefix=sql-perf-report-
store-analysis-prefix=저장소분석:
analysis-sql=SQL 분석
open-perf-report=보고서 열기		Alt+O
drop-perf-report=보고서 삭제		Alt+Del
drop-perf-report-confirm-text=보고서를 삭제하시겠습니까?
store-analysis-text=자료기둥, 자료표, 표색인의 저장용량을 분석할수 있습니다.
table-store-analysis=표 - {tblName}
index-store-analysis=색인 - {idxName} - 소속표:{tblName}
db-disk-used-title=디스크공간사용률 보고서, DB 경로:{dbPath}
page-size-text=페이지크기 (단위: 바이트)
page-size-tips=페이지크기 (단위: 바이트)
file-bytes-text=파일크기 (단위: 바이트)
file-bytes-tips=파일크기 (단위: 바이트)
file-pgcnt-text=전체파일의 페이지수 (측정값)
file-pgcnt-tips=전체파일의 페이지수 (측정값)
file-pgcnt2-text=전체파일의 페이지수 (계산값)
file-pgcnt2-tips=전체파일의 페이지수 (계산값)
inuse-pgcnt-text=데이터저장 페이지수 (사용중)
inuse-pgcnt-tips=데이터저장 페이지수 (사용중)
free-pgcnt2-text=데이터저장 안 된 페이지수 (각 헤더)
free-pgcnt2-tips=데이터저장 안 된 페이지수 (각 헤더)
free-pgcnt-text=데이터저장 안 된 페이지수 (계산값)
free-pgcnt-tips=데이터저장 안 된 페이지수 (계산값)
av-pgcnt-text=자동삭제된 페이지수
av-pgcnt-tips=자동삭제된 페이지수
ntable-text=자료기둥 내 표수
ntable-tips=자료기둥 내 표수
nindex-text=색인수
nindex-tips=색인수
nmanindex-text=정의색인수
nmanindex-tips=정의색인수
nautoindex-text=암시색인수 (자동증가색인)
nautoindex-tips=암시색인수 (자동증가색인)
user-payload-text=사용자유효부하 저장바이트수
user-payload-tips=사용자유효부하 저장바이트수
all-tbl-entrycnt-title=모든 표데이터량 (건수)
all-tbl-idx-pagecnt-title=모든 표 및 색인의 페이지수
sperate-tbl-idx-pagecnt-title=모든 표 및 색인의 페이지수分別計算
all-tbl-idx-report-title=모든 표 및 색인
total-pages-percent-text=자료기둥총수의 비율
total-pages-percent-tips=자료기둥총수의 비율
nentry-text=데이터량 (건수)
nentry-tips=데이터량 (건수)
storage-text=소비된 저장바이트수
storage-tips=소비된 저장바이트수
compressed-size-text=압축후 사용된 바이트수
compressed-size-tips=압축후 사용된 바이트수
payload-text=유효부하의 바이트수
payload-tips=유효부하의 바이트수
total-meta-text=메타데이터의 바이트수
total-meta-tips=메타데이터의 바이트수
depth-text=B 트리깊이
depth-tips=B 트리깊이
avg-payload-text=각 데이터의 평균유효부하
avg-payload-tips=각 데이터의 평균유효부하
avg-unused-text=각 데이터의 평균미사용바이트수
avg-unused-tips=각 데이터의 평균미사용바이트수
avg-meta-text=각 데이터의 평균메타데이터
avg-meta-tips=각 데이터의 평균메타데이터
avg-fanout-text=평균 fanout 수
avg-fanout-tips=평균 fanout 수
gap-cnt-text=비연속페이지
gap-cnt-tips=비연속페이지
mx-payload-text=각 데이터의 최대유효부하
mx-payload-tips=각 데이터의 최대유효부하
ovfl-cnt-text=사용된 오버플로데이터건수
ovfl-cnt-tips=사용된 오버플로데이터건수
int-pages-text=사용된 색인페이지수
int-pages-tips=사용된 색인페이지수
leaf-pages-text=사용된 리프페이지수
leaf-pages-tips=사용된 리프페이지수
ovfl-pages-text=사용된 오버플로페이지수
ovfl-pages-tips=사용된 오버플로페이지수
total-pages-text=사용된 총페이지수
total-pages-tips=사용된 총페이지수
int-unused-text=색인페이지상의 미사용바이트수
int-unused-tips=색인페이지상의 미사용바이트수
leaf-unused-text=리프페이지상의 미사용바이트수
leaf-unused-tips=리프페이지상의 미사용바이트수
ovfl-unused-text=오버플로페이지상의 미사용바이트수
ovfl-unused-tips=오버플로페이지상의 미사용바이트수
total-unused-text=모든페이지상의 미사용바이트수
total-unused-tips=모든페이지상의 미사용바이트수
all-table-report-title=모든 표 (색인제외)
all-indices-report-title=모든 색인 (표제외)
tbl-and-all-idx-report-title=표 {tblName} 및 모든 색인
tbl-only-report-title=표 {tblName} 색인제외
idx-only-report-title=표 {tblName} 의 모든 색인
tbl-report-title=표 {tblName}
idx-report-title=표 {tblName} 의 색인 {idxName}
props-tbl-only-report-title=표 {tblName} 저장소분석
props-idx-props-only-report-title=표 {tblName} 의 모든 색인
db-pragma-params=PRAGMA 매개변수
db-quick-config-params=빠른 구성方案
select-pragma=PRAGMA
pragma-analysis-limit-tips=근사분석 (ANALYZE) 설정의 제한을 질의 또는 변경합니다. 이는 분석 (ANALYZE) 명령이 각 색인에서 확인하는 대략적인 행수입니다.
pragma-application-id-tips=자료기둥헤더 내 오프셋 68 에 있는 32 비트 부호付き빅엔디안"Applicatioin ID"정수를 질의 또는 설정하는 데 사용됩니다.
pragma-auto-vacuum-tips=자료기둥 내 자동삭제상태를 질의 또는 설정합니다.
pragma-automatic-index-tips=자동색인기능을 질의, 설정 또는 제거합니다.
pragma-busy-timeout-tips=바쁨시간초과 (busy timeout) 설정을 질의 또는 변경합니다.
pragma-cache-size-tips=각 열린 자료기둥파일마다 기억기 내에 유지되는 SQLite 권장 최대자료기둥디스크페이지수를 질의 또는 변경합니다.
pragma-cache-spill-tips=트랜잭션 중 더티캐시페이지를 자료기둥파일로 오버플로우시키는 페이지어기능을 활성화 또는 비활성화합니다.
pragma-case-sensitive-like-tips=LIKE 연산자의 기본동작은 ASCII 문자의 대소문자를 무시하는 것입니다. 따라서 기본적으로'a'LIKE'A'는 true 입니다.
pragma-cell-size-check-tips=디스크에서 자료기둥 B 트리페이지를 처음 읽을 때 다른 건전성검사를 활성화 또는 비활성화합니다. 셀크기검사를 활성화하면 자료기둥손상을 더 일찍 감지할수 있으며"확산 (Spread)"될 가능성이 적습니다.
pragma-checkpoint-fullfsync-tips=체크포인트작업의 fullfsync 플래그를 질의 또는 변경합니다. 이 플래그가 설정되면 F_FULLFSYNC 를 지원하는 체계에서 체크포인트작업 실행 중 F_FULLFSYNC 동기화방법이 사용됩니다. CHECKPOINT_FULLFSYNC 플래그의 기본값은 OFF 입니다. Mac OS-X 만 F_FULLFSYNC 를 지원합니다.
pragma-collation-list-tips=현재 자료기둥연결에 정의된照合順序의 목록을 반환합니다.
pragma-compile-options-tips=SQLite 를 빌드할 때 사용된 컴파일시 옵션이름을 한 줄씩 반환합니다.
pragma-count-changes-tips=카운트변경플래그를 질의 또는 변경합니다. 일반적으로 count-changes 플래그가 설정되지 않은 경우 INSERT, UPDATE 및 DELETE 문은 데이터를 반환하지 않습니다.
pragma-data-store-directory-tips=sqlite3_data_directory 전역변수값을 질의 또는 변경합니다. Windows 운영체계 인터페이스백엔드는 상대경로이름으로 지정된 자료기둥파일의 저장위치를 결정하기 위해 이 변수를 사용합니다.
pragma-data-version-tips=자료기둥파일이 수정되였음을 나타냅니다. 기억기 내 자료기둥내용을 저장하거나 화면에 자료기둥내용을 표시하는 인터랙티브프로그램은 PRADMA data_version 명령을 사용하여 기억기를 새로 고치고 다시 로드하거나 화면표시를 업데이트해야 하는지 여부를 결정할수 있습니다.
pragma-default-cache-size-tips=각 열린 자료기둥파일에 할당될 권장 최대디스크캐시페이지수를 질의 또는 설정합니다.
pragma-defer-foreign-keys-tips=모든 외부키제약을 가장 바깥쪽 트랜잭션의 커밋까지 지연시킵니다.
pragma-empty-result-callbacks-tips=빈결과콜백플래그를 질의 또는 변경합니다.
pragma-encoding-tips=주 자료기둥에서 사용되는 텍스트부호화. 'UTF-8', 'UTF-16le'(리틀엔디안 UTF-16 부호화) 또는'UTF-16be'(빅엔디안 UTF-16 부호화) 중 하나.
pragma-foreign-key-check-tips=자료기둥 또는 표에 외부키제약위반이 있는지 확인합니다.
pragma-foreign-keys-tips=외부키제약이행을 질의, 설정 또는 제거합니다.
pragma-freelist-count-tips=자료기둥파일 내 미사용페이지수를 반환합니다.
pragma-full-column-names-tips=full_column_names 플래그를 질의 또는 변경합니다.
pragma-fullfsync-tips=fullfsync 플래그를 질의 또는 변경합니다. 이 플래그는 F_FULLFSYNC 동기화방법을 지원하는 체계에서 해당 방법 사용여부를 결정합니다. Fullfsync 플래그의 기본값은 OFF 입니다. Mac OS X 만 F_FULLFSYNC 를 지원합니다.
pragma-hard-heap-limit-tips=단일프로세스 내 모든 자료기둥연결의 힙기억기양에 제한을 둡니다.
pragma-ignore-check-constraints-tips=검사제약강제를 활성화 또는 비활성화합니다. 기본설정은 OFF 로, 이는 기본적으로 검사제약이 강제됨을 의미합니다.
pragma-incremental-vacuum-tips=최대 N 개의 페이지를 프리리스트에서 삭제합니다.
pragma-integrity-check-tips=자료기둥에 대해 저수준포맷 및 일관성검사를 실행합니다.
pragma-journal-mode-tips=현재 자료기둥연결과 연관된 자료기둥의 저널모드를 질의 또는 설정합니다.
pragma-journal-size-limit-tips=트랜잭션 또는 체크포인트후 파일체계 남아 있는 롤백로그 및 WAL 파일크기를 제한합니다.
pragma-legacy-alter-table-tips=legacy_alter_table 플래그값을 설정 또는 질의합니다.
pragma-locking-mode-tips=자료기둥연결잠금모드를 설정 또는 질의합니다. 잠금모드는 일반모드 (NORMAL) 또는 배타적모드 (EXCLUSIVE) 입니다.
pragma-max-page-count-tips=자료기둥파일 내 최대페이지수를 질의 또는 설정합니다.
pragma-mmap-size-tips=단일자료기둥 상의 기억기맵 I/O(memory-mapped I/O) 에 유지될 최대바이트수를 질의 또는 변경합니다.
pragma-module-list-tips=자료기둥연결에 등록된 가상표모듈 목록을 반환합니다.
pragma-optimize-tips=자료기둥을 최적화하려고 합니다.
pragma-page-count-tips=자료기둥파일 내 총페이지수를 반환합니다.
pragma-page-size-tips=자료기둥의 페이지크기를 질의 또는 설정합니다. 페이지크기는 512% 와 65536 사이의 2 의 거듭제곱이어야 합니다.
pragma-parser-trace-tips=SQLite 내부에서 사용되는 SQL 파서의 추적을 켭니다. SQLITE_DEBUG 로 컴파일 시生效됩니다.
pragma-query-only-tips=자료기둥파일 상의 데이터변경을 방지합니다. 이것이 활성화되면 CREATE, REPORT, DROP, REPORT 또는 UPDATE 시도는 모두 SQLITE_READONLY 오류를 발생시킵니다.
pragma-quick-check-tips=자료기둥에 대해 저수준포맷설정 및 일관성검사를 실행하고 UNIQUE 및 색인일관성검사를 건너뜁니다.
pragma-read-uncommitted-tips=READ UNCOMMITTED 격리를 질의, 설정 또는 제거합니다.
pragma-recursive-triggers-tips=트리거의 재귀기능을 질의, 설정 또는 제거합니다.
pragma-reverse-unordered-selects-tips=활성화되면 이 PRAGMA 는 ORDER BY 절이 없는 많은 SELECT 문이 일반적으로 반대순서로 결과를 발행하도록 합니다.
pragma-schema-version-tips=자료기둥헤더 내 오프셋 40 处的 chema-versio 정수값을 가져오거나 설정합니다.
pragma-secure-delete-tips=안전삭제 (secure-delete) 설정을 질의 또는 변경합니다.
pragma-short-column-names-tips=짧은 열이름 플래그를 질의 또는 변경합니다.
pragma-soft-heap-limit-tips=단일프로세스 내 모든 자료기둥연결에 대해 점유하는 힙기억기양을 제한합니다.
pragma-stats-tips=표 및 색인에 대한 보조정보를 반환합니다.
pragma-synchronous-tips="동기화 (synchronous)"플래그설정을 질의 또는 변경합니다.
pragma-temp-store-tips=sqlite3_temp_directory 전역변수값을 질의 또는 변경합니다. 많은 운영체계 인터페이스백엔드는 임시표 및 색인을 저장할 위치를 결정하기 위해 이 변수를 사용합니다.
pragma-threads-tips=준비된 문 (prepared statement) 이 질의를 지원하기 위해 시작하는 보조스레드수.
pragma-trusted-schema-tips=스키마 내에서 안전검토되지 않은 SQL 함수 및 가상표 실행을 허용할지 여부. 보기, 트리거 또는 스키마식 (CHECK 제약, DEFAULT 절, 생성열, 식색인 및/또는 부분색인 등) 이 안전검토되지 않은 SQL 함수 및 가상표를 실행하는 것을 허용할지 여부를 결정합니다.
pragma-user-version-tips=자료기둥헤더 내 오프셋 60 处的 user-version 정수값을 가져오거나 설정합니다.
pragma-vdbe-addoptrace-tips=완전한 VDBE 오피코드가 코드생성 중 생성될 때 표시됩니다. SQLite 가 SQLITE_DEBUG 옵션으로 컴파일되고 vdbe_debug 가 켜져 있어야 합니다.
pragma-vdbe-debug-tips=VDBE 디버그를 켭니다. SQLite 가 SQLITE_DEBUG 옵션으로 컴파일되어 있어야 합니다.
pragma-vdbe-listing-tips=표준출력에 완전한 가상머신 오피코드 목록을 표시합니다. SQLite 가 SQLITE_DEBUG 옵션으로 컴파일되고 vdbe_debug 가 켜져 있어야 합니다.
pragma-vdbe-trace-tips=계산 시 표준출력에 가상머신 오피코드를 인쇄합니다. SQLite 가 SQLITE_DEBUG 옵션으로 컴파일되고 vdbe_debug 가 켜져 있어야 합니다.
pragma-wal-autocheckpoint-tips=선행쓰기로그 (write-ahead log)/auto-checkpoint 간격을 질의 또는 설정합니다.
pragma-wal-checkpoint-tips=자료기둥연결 D 상의 자료기둥 X 의 선행쓰기로그 (write-ahead log) 내용을 자료기둥파일로 전송하고 선행쓰기로그 (write-ahead log) 를 재설정합니다.
pragma-writable-schema-tips=일반 UPDATE, INSERT 및 DELETE 문을 사용하여 sqlite_schema 표를 변경할수 있습니다. 경고: 이 컴파일지시를 남용하면 자료기둥파일손상을 초래할수 있습니다.
pragma-save-confirm=PRAGMA 문은 자료기둥실행에 영향을 줍니다. 아래 문을 실행하시겠습니까?
confirm-exec-text=확인&실행